#Дано целое число в диапазоне 1-7. Вывести строку — название дня недели,соответствующее данному числу (1 — «понедельник», 2 — «втор

k = input("Введите число от 1 до 7: ")
while type(k) != int:
    try:
        k = int(k)
    except ValueError:
        print("Введенно некорректное число: ")
        k = input("Введите число от 1 до 7: ")

if k == 1:
    print("понедельник")
elif k == 2:
    print("вторник")
elif k == 3:
    print("среда")
elif k == 4:
    print("четверг")
elif k == 5:
    print("пятница")
elif k == 6:
    print("суббота")
elif k == 7:
    print("воскресенье")
else:
    print("ошибка")